// // зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
// let arr = [2,17,13,6,22,31,45,66,100,-18];
// //     1. перебрати його циклом while
// let i = 0;
// while (i < arr.length){
//     console.log(arr[i]);
//     i++;
// }
// //     2. перебрати його циклом for
// for ( let i = 0; i < arr.length; i++) {
//     console.log(arr[i]);
// }
// //     3. перебрати циклом while та вивести  числа тільки з непарним індексом
// let i = 0;
// while (i<arr.length){
//     if (i%2 ===1){
//         console.log(arr[i]);
//     }
//     i++;
// }
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// for (let i = 0; i < arr.length; i++) {
//     if (i%2 === 1){
//         console.log(arr[i]);
//     }
// }
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// let i =0;
// while (i<arr.length){
//     if (arr[i]%2 ===0){
//         console.log(arr[i]);
//     }
//     i++;
// }
// // 6. перебрати циклом for та вивести  числа тільки парні  значення
// for (let i = 0; i < arr.length; i++) {
//     if (arr[i]%2 === 0) {
//         console.log(arr[i]);
//     }
// }
// // 7. замінити кожне число кратне 3 на слово "okten"
// for (let i = 0; i < arr.length; i++) {
//     if (arr[i]%3 === 0){
//         arr[i]= 'okten';
//     }
// }
// console.log(arr);
// // 8. вивести масив в зворотньому порядку.
// let i =arr.length-1;
// while (i>=0){
//     console.log(arr[i]);
//     i--;
// }
// // 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// for (let i = arr.length-1; i >=0; i--) {
//     if (arr[i]%3 === 0){
//         arr[i]= 'okten';
//     }
// }
// console.log(arr);
// console.log('--------------');
// for ( i = arr.length-1; i >= 0; i--) {
//     if (arr[i]%2 === 0) {
//         console.log(arr[i]);
//     }
// }
// console.log('-------------------');
// i = arr.length-1;
// while (i >=0 ){
//     console.log(arr[i]);
//     i--;
// }
// 10
// // створити пустий масив та :
// let arr = [];
//     // - заповнити його 50 парними числами за допомоги циклу.
// for (let i = 0; i < 50; i++) {
//     arr[i]= i*2;
//     console.log(arr[i]);
// }
// // - заповнити його 50 непарними числами за допомоги циклу.
// let i =0;
// while (i<50){
//     arr[i]= i*2+1;
//     console.log(arr[i]);
//     i++;
// }
//
// 1
// // створити пустий масив та :
// let arr =[];
//     1. заповнити його 50 парними числами за допомоги циклу.
// for (let i = 0; i < 50; i++) {
//     arr[i]= i*2;
//     console.log(arr[i]);
// }
// 2. заповнити його 50 непарними числами за допомоги циклу.
// let i =0;
// while (i<50){
//     arr[i]= i*2+1;
//     console.log(arr[i]);
//     i++;
// }
// // 3. используя Math.random заполнить массив из ???(сколько хотите) элементов.
// //     диапазон рандома 8 до 732. (но сначала пробуйте БЕЗ ДИАПАЗОНА!)
// for (let i = 0; i < 50; i++) {
//     arr[i] = Math.floor( Math.random()*(732-8+1))+8;
//     // console.log(arr[i]);
// }
// // 2. вывести на консоль  каждый третий елемент
// i = 0;
// while (i < arr.length){
//     console.log(arr[i]);
//     i+=3;
// }
// console.log('------------------');
// // 3. вывести на консоль  каждый третий елемент
// // но при условии что его значение является парным.
// for (i = 0; i < arr.length; i+=3) {
//     if(arr[i]%2 === 0){
//         console.log(arr[i]);
//     }
// }
//
// // 4. вывести на консоль  каждый третий елемент
// // но при условии что он имеет парное значение и
// // записать их в другой массив.
// let arr2 =[];
// for (i = 0; i < arr.length; i+=3) {
//     if(arr[i]%2 === 0){
//         arr2.push(arr[i])
//     }
// }
// console.log(arr2);
// // 5. Вывести каждый елемент массива у которого соседний с права элемент - парный
// for (i = 0; i < arr.length-1; i++) {
//     if(arr[i+1]%2 === 0){
//         console.log(arr[i]);
//     }
//
// }
// 5 масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. обрахувати середній чек.
// let arr = [100,250,50,168,120,345,188];
// let sum =0;
// for (let i = 0; i < arr.length; i++) {
//     sum += arr[i];
// }
// let avarege = sum / arr.length;
// console.log(avarege);
// 3 створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
// let arr= [];
// let arr2 = [];
// for (let i = 0; i < 10; i++) {
//     arr[i]= Math.floor(Math.random()*(100+1));
//     arr2.push(arr[i]*5);
// }
// console.log(arr, arr2);
// 4 створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо об'єкт є числом,
// додати його в інший масив.
// let arr = [123, 'asd', {name:'andrew', age:12, status: true}, [1,2,3], 321, '123', '321', 53, NaN, undefined, null];
// let arr2 = [];
// for (let i = 0; i < arr.length; i++) {
//     if(typeof arr[i] === 'number'){
//         arr2.push(arr[i]);
//     }
//
// }
// console.log(arr2);
